# Практическое задание 02 Работа с данными

## 01 Работа со строками

```python
string1 = 'This is a string.'
string2 = " This is another string."

con=string1+string2 #конкатенация
print(con) 
print(len(string1)) #len() - определяет длину строки;
print(string1.title()) #title() - преобразует первый символ каждого слова в строке к верхнему регистру;L
print(string1.lower()) #lower() - символы строки преобразуются к нижнему регистру;
print(string1.upper()) #upper() - символы строки преобразуются к верхнему регистру;
print(string1.rstrip()) #rstrip() – удаляются пробелы в конце строки;
print(string1.lstrip()) #lstrip() – удаляются пробелы в начале строки;
print(string1.strip()) #strip() - удаляются пробелы с обоих концов;
print(string1.strip('T')) #strip('0') - удаляются с обоих концов указанные символы в параметре функции.

# Извлечение символов и подстрок
d = "qwerty"
ch = d[2] # извлекается символ ‘e’
print(ch)
chm = d[1:3] # извлекается срез(slicing) варианты: d[1:], d[:3], d[:], d[1:5:2].
print(chm)
```

## 02 Работа с числами

```python
A=9
B=3
C=2

A+B #сумма
A-B #разность
A*B #произведение
A/B #частное
A**B #возведение в степень
A**0.5 # квадратный корень из A
A**(1/B) #корень степени B
-A #унарный минус
A//C # целочисленное деление
A%C # остаток от деления
```

## 03 Преобразование данных

```python
param = "string" + str(15)

int(12.4) #Преобразовывает в целое число -> 12
# long(20) #Преобразовывает в long Python 2.x -> 20L
float(10) #Преобразовывает в число с плавающей точкой -> 10.0
complex(20) #Создает комплексное число -> (20+0j)
str(10) #Преобразовывает в строку -> '10'
tuple("hello") #Преобразовывает в кортеж -> ( "h","e","l","l","o" )
list("Python") #Преобразовывает в список -> [ "P","y","t","h","o","n" ]
dict( [ (1,2), (3,4) ] ) #Создает словарь -> { 1:2, 3:4 }

'''Составьте программу, запрашивающую у пользователя два числа и
реализующую их сложение.'''

n1 = input("Enter the first number: ")
n2 = input("Enter the second number: ")
n3 = float(n1) + float(n2)
print(n1 + " plus " + n2 + " = ", n3)
```

## 04 Форматирование строк

```python
a = 1/3
print("{:7.3f}".format(a))

a = 2/3
b = 2/9
print("{:7.3f} {:7.3f}".format(a, b))
print("{:10.3e} {:10.3e}".format(a, b))
```

## 05 Списки

```python
list1 = [82,8,23,97,92,44,17,39,11,12]
list1.insert(3,20) #  вставляет элемент 20 в список по указанному 3
list1.append(6) # добавляет элемент в конец списка
list1.remove(8) # удаляет первое вхождение указанного элемента из списка (удалит число 8). Не найден, метод вызывает исключение ValueError.
list1.reverse() # меняет порядок элементов в списке на обратный

list1.sort() # сортирует в порядке возрастания. Список содержит строки, будут отсортированы в лексикографическом порядке.

list2 = [3,5,6,2,33,6,11]
lis = sorted(list2) # сортирует в порядке возрастания не меняя исходный список.
print(lis)
print(' '.join(map(str, lis))) 
```

## 06 Кортежи (tuple) 
Последовательность данных, которые невозможно изменить.

```python
seq = (2,8,23,97,92,44,17,39,11,12)

print(seq.count(8)) # возвращает количество вхождений указанного значения
print(seq.index(44)) # возвращает индекс первого вхождения указанного значения

listseq = list(seq) # Преобразует кортеж к типу «список»
print(type(listseq))
```

## 07 Словари 
Любой объект Python, может стать значением в словаре.

```python
D = {'food': 'Apple', 'quantity': 4, 'color': 'Red'}
print(D['food'])
D['quantity']+=10
print(D['quantity'])

'''Напишите инструкцию, заполняющую словарь значениями, вводимыми с
клавиатуры в создаваемые ‘на лету’ ключи ‘name’ и ‘age’.'''

dp = {}
count = int(input("Количество записей: "))

for i in range(count):
    name = input("Имя "+str(i+1)+": ")
    age = int(input("Возраст "+str(i+1)+": "))
    dp[name] = age
print(dp)
```

## 08 Вложенность хранения данных

```python
rec = {'name': {'firstname': 'Bob', 'lastname': 'Smith'},
       'job': ['dev', 'mgr'],
       'age': 25}
rec['job'].append('janitor') # добавляем в список должностей

# print(rec)
print("Имя: "+rec['name']['firstname'])
print("Фамилия: "+rec['name']['lastname'])
print("Возраст: "+str(rec['age']))
print("Должности: "+' '.join(rec['job']))
```